# Используем легковесный официальный образ Node.js
FROM node:20-alpine

# Указываем рабочую папку внутри контейнера
WORKDIR /usr/src/app

# Сначала копируем только файлы с зависимостями
COPY package*.json ./

# Устанавливаем зависимости
RUN npm install

# Копируем весь остальной код проекта
COPY . .

# Собираем проект (NestJS компилирует TypeScript в JavaScript в папку dist)
RUN npm run build

# Открываем порт, на котором работает NestJS (по умолчанию 3000)
EXPOSE 3000

# Команда для запуска скомпилированного приложения
CMD ["node", "dist/main"]
